# Data Frame and series basics - selection row and columns

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("employee_data.csv")
df.head()

,EmployeeID,Name,Age,Gender,Department,JobTitle,Salary,DateOfJoining,MaritalStatus,Education,...,Email,PhoneNumber,City,EmploymentType,IsRemote,LastWorkingDay,LeavesTakenLastYear,ProjectsHandled,Certifications,PromotionEligible
0,1000,George Williams,50,Male,HR,Consultant,65057,10/8/2017,Single,Master,...,george.williams@corporate.org,1762717327,Dhaka,Contract,No,16:21.8,18,1,AWS,Yes
1,1001,Jane Brown,36,Female,Sales,Executive,31239,3/7/2021,Single,PhD,...,jane.brown@corporate.org,1566784995,Sylhet,Part-time,No,54:32.7,10,5,Scrum Master,Yes
2,1002,George Johnson,29,Female,Support,Manager,95661,9/27/2016,Single,High School,...,george.johnson@corporate.org,1348371389,Rajshahi,Full-time,Yes,54:32.7,17,9,AWS,Yes
3,1003,Hannah Williams,42,Other,Engineering,Manager,75272,11/18/2018,Single,PhD,...,hannah.williams@corporate.org,1564436727,Barisal,Full-time,No,16:21.8,3,3,Data Analyst,Yes
4,1004,George Davis,40,Other,IT,Developer,119393,3/14/2019,Married,Master,...,george.davis@example.com,1130130576,Dhaka,Part-time,Yes,27:16.4,15,4,Scrum Master,No

In [3]:
df.shape

(550, 25)

In [4]:
df.columns

Index(['EmployeeID', 'Name', 'Age', 'Gender', 'Department', 'JobTitle',
       'Salary', 'DateOfJoining', 'MaritalStatus', 'Education', 'OverTime',
       'MonthlyIncome', 'Hobbies', 'ProgrammingSkills', 'Religion', 'Email',
       'PhoneNumber', 'City', 'EmploymentType', 'IsRemote', 'LastWorkingDay',
       'LeavesTakenLastYear', 'ProjectsHandled', 'Certifications',
       'PromotionEligible'],
      dtype='object')

In [5]:
df['Department']

0               HR
1            Sales
2          Support
3      Engineering
4               IT
          ...
545    Engineering
546      Logistics
547    Engineering
548             IT
549          Sales
Name: Department, Length: 550, dtype: object

In [6]:
df['Department'].value_counts()

Department
Finance        76
HR             75
Sales          73
Support        71
Engineering    71
IT             68
Logistics      62
Marketing      54
Name: count, dtype: int64

In [7]:
df.loc[0]

EmployeeID                                      1000
Name                                 George Williams
Age                                               50
Gender                                          Male
Department                                        HR
JobTitle                                  Consultant
Salary                                         65057
DateOfJoining                              10/8/2017
MaritalStatus                                 Single
Education                                     Master
OverTime                                         Yes
MonthlyIncome                                   6705
Hobbies                              Gaming, Cooking
ProgrammingSkills                       Go, SQL, PHP
Religion                                    Buddhism
Email                  george.williams@corporate.org
PhoneNumber                               1762717327
City                                           Dhaka
EmploymentType                              Contract
IsRemote                                          No
LastWorkingDay                               16:21.8
LeavesTakenLastYear                               18
ProjectsHandled                                    1
Certifications                                   AWS
PromotionEligible                                Yes
Name: 0, dtype: object

In [8]:
df.loc[0, 'Department']

'HR'

In [9]:
df.loc[[0, 1, 2, 3, 4, 5], 'Department']  #df.loc[0:5, 'Department']

0             HR
1          Sales
2        Support
3    Engineering
4             IT
5        Finance
Name: Department, dtype: object

In [10]:
df.loc[0:5, 'Department']   #df.loc[[0, 1, 2, 3, 4, 5], 'Department']

0             HR
1          Sales
2        Support
3    Engineering
4             IT
5        Finance
Name: Department, dtype: object

In [11]:
df.loc[[0, 1, 2, 3, 4, 5], ['Name', 'Age', 'Gender', 'Department', 'JobTitle', 'Salary', 'DateOfJoining', 'MaritalStatus',
                            'Education', 'OverTime', 'MonthlyIncome', 'Hobbies', 'ProgrammingSkills']]   #df.loc[0:5, "Name":"ProgrammingSkills"]

,Name,Age,Gender,Department,JobTitle,Salary,DateOfJoining,MaritalStatus,Education,OverTime,MonthlyIncome,Hobbies,ProgrammingSkills
0,George Williams,50,Male,HR,Consultant,65057,10/8/2017,Single,Master,Yes,6705,"Gaming, Cooking","Go, SQL, PHP"
1,Jane Brown,36,Female,Sales,Executive,31239,3/7/2021,Single,PhD,No,3044,Traveling,NaN
2,George Johnson,29,Female,Support,Manager,95661,9/27/2016,Single,High School,Yes,4901,"Traveling, Gardening","Ruby, SQL, JavaScript"
3,Hannah Williams,42,Other,Engineering,Manager,75272,11/18/2018,Single,PhD,No,7338,Photography,Ruby
4,George Davis,40,Other,IT,Developer,119393,3/14/2019,Married,Master,Yes,4864,"Music, Cooking","Java, Go"
5,Diana Garcia,44,Male,Finance,Technician,91212,11/17/2011,Single,High School,No,3789,Music,"Go, C++"

In [12]:
df.loc[0:5, "Name":"ProgrammingSkills"]   #df.loc[[0, 1, 2, 3, 4, 5], ['Name', 'Age', 'Gender', 'Department', 'JobTitle', 'Salary', 'DateOfJoining', 'MaritalStatus','Education', 'OverTime', 'MonthlyIncome', 'Hobbies', 'ProgrammingSkills']]

,Name,Age,Gender,Department,JobTitle,Salary,DateOfJoining,MaritalStatus,Education,OverTime,MonthlyIncome,Hobbies,ProgrammingSkills
0,George Williams,50,Male,HR,Consultant,65057,10/8/2017,Single,Master,Yes,6705,"Gaming, Cooking","Go, SQL, PHP"
1,Jane Brown,36,Female,Sales,Executive,31239,3/7/2021,Single,PhD,No,3044,Traveling,NaN
2,George Johnson,29,Female,Support,Manager,95661,9/27/2016,Single,High School,Yes,4901,"Traveling, Gardening","Ruby, SQL, JavaScript"
3,Hannah Williams,42,Other,Engineering,Manager,75272,11/18/2018,Single,PhD,No,7338,Photography,Ruby
4,George Davis,40,Other,IT,Developer,119393,3/14/2019,Married,Master,Yes,4864,"Music, Cooking","Java, Go"
5,Diana Garcia,44,Male,Finance,Technician,91212,11/17/2011,Single,High School,No,3789,Music,"Go, C++"

## Data Frame (dict)

In [13]:
Person = {
    "First Name" : "Asif Antaj",
    "Last Name" : "Robin",
    "Email" : "asifantajrobin@gmal.com"
}

In [14]:
People = {
    "First Name" : ["Asif Antaj", "Afrin Jahan", "Afifa Jahan", "Asif Antaj"],
    "Last Name" : ["Robin", "Rupa", "Rafa", "Rayhan"],
    "Email" : ["asifantajrobin@gmal.com", "afrin@gmail.com", "afifa@gmail.com", "asif@gmail.com"]
}

In [15]:
People['Email']

['asifantajrobin@gmal.com',
 'afrin@gmail.com',
 'afifa@gmail.com',
 'asif@gmail.com']

In [16]:
dict_df = pd.DataFrame(People)
dict_df

    First Name Last Name                    Email
0   Asif Antaj     Robin  asifantajrobin@gmal.com
1  Afrin Jahan      Rupa          afrin@gmail.com
2  Afifa Jahan      Rafa          afifa@gmail.com
3   Asif Antaj    Rayhan           asif@gmail.com

In [17]:
dict_df['Email']

0    asifantajrobin@gmal.com
1            afrin@gmail.com
2            afifa@gmail.com
3             asif@gmail.com
Name: Email, dtype: object

In [18]:
dict_df.Email

0    asifantajrobin@gmal.com
1            afrin@gmail.com
2            afifa@gmail.com
3             asif@gmail.com
Name: Email, dtype: object

In [19]:
dict_df[["First Name", "Email"]]

    First Name                    Email
0   Asif Antaj  asifantajrobin@gmal.com
1  Afrin Jahan          afrin@gmail.com
2  Afifa Jahan          afifa@gmail.com
3   Asif Antaj           asif@gmail.com

In [20]:
dict_df.columns

Index(['First Name', 'Last Name', 'Email'], dtype='object')

In [21]:
dict_df.shape

(4, 3)

In [22]:
dict_df.iloc[0]

First Name                 Asif Antaj
Last Name                       Robin
Email         asifantajrobin@gmal.com
Name: 0, dtype: object

In [23]:
dict_df.loc[[0, 1]]

    First Name Last Name                    Email
0   Asif Antaj     Robin  asifantajrobin@gmal.com
1  Afrin Jahan      Rupa          afrin@gmail.com

In [24]:
dict_df.iloc[[0, 1], [2]]

                     Email
0  asifantajrobin@gmal.com
1          afrin@gmail.com

In [25]:
dict_df.loc[[0,1], ["First Name", "Email"]]

    First Name                    Email
0   Asif Antaj  asifantajrobin@gmal.com
1  Afrin Jahan          afrin@gmail.com

Asif Antaj Robin
Cumilla Polytechnic Institute (CPI)
Computer Science and Technology (CST)
Phone Number : 01312531960